      ******************************************************************
      * Author: Eliott Bonte
      * Date: 01/11/2022
      * Purpose: This is my first shell, I can use it as minimal skeleton of a
      * COBOL program, to save time.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBSHL01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

           WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.

       PROGRAM-DONE.
           STOP RUN.
